bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
/**
 * @file hwzc.c
 *
 * @brief Hardware ZC detection via ADC digital comparators + SCCP timers.
 *
 * State machine per commutation step:
 *   BLANKING -> WATCHING -> COMM_PENDING -> commutate -> BLANKING
 *
 * All functions called from priority-7 ISRs (comparator or SCCP1) except
 * HWZC_Init (called from ServiceInit) and HWZC_Enable (called from ADC ISR
 * at the moment of crossover handoff).
 *
 * Binding rules enforced:
 *   Rule 2: Comparator IE disabled before PINSEL changes
 *   Rule 3: hwzc.phase written BEFORE starting SCCP1 timer
 *   Rule 4: Threshold from garudaData.bemf.zcThreshold
 *   Rule 10: Comparator ISR trusts ADnCMPSTAT, no re-read
 *   Rule 13: stepPeriodHR protected by seqlock (writeSeq)
 *
 * Component: HWZC
 */

#include "../garuda_config.h"

#if FEATURE_ADC_CMP_ZC

#include "hwzc.h"
#include "commutation.h"
#include "../garuda_calc_params.h"
#include "../hal/hal_adc.h"
#include "../hal/hal_timer.h"
#if FEATURE_HWZC_PI_FLOAT && HWZC_PI_FF_ENABLE
#include "../garuda_foc_params.h"   /* VBUS_SCALE_V_PER_COUNT */
#endif
#include <xc.h>

/**
 * @brief Initialize HWZC state to idle defaults.
 * Called from GARUDA_ServiceInit().
 */
void HWZC_Init(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.enabled = false;
    pData->hwzc.enablePending = false;
    pData->hwzc.activeCore = 0;
    pData->hwzc.lastZcStamp = 0;
    pData->hwzc.lastCommStamp = 0;
    pData->hwzc.stepPeriodHR = 0;
    pData->hwzc.writeSeq = 0;
    pData->hwzc.commSeq = 0;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.fallbackPending = false;
    pData->hwzc.firstZcAfterEnable = false;
    pData->hwzc.dbgLatchDisable = false;
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.totalZcCount = 0;
    pData->hwzc.totalMissCount = 0;
    pData->hwzc.totalCommCount = 0;
    pData->hwzc.rejectsThisStep = 0;
    pData->hwzc.dbgTimeoutAdcVal = 0;
    pData->hwzc.dbgTimeoutThresh = 0;
    pData->hwzc.dbgTimeoutCmpmod = 0;
    pData->hwzc.dbgTimeoutCmpstat = 0;
    pData->hwzc.dbgTimeoutCore = 0;
    pData->hwzc.dbgTimeoutStep = 0;
    pData->hwzc.dbgTimeoutBemfThresh = 0;
    pData->hwzc.dbgEnableStepPeriod = 0;
    pData->hwzc.dbgAdvanceDeg = 0;
    pData->hwzc.dbgFilterOffset = 0;
#if FEATURE_HWZC_SECTOR_PI
    pData->hwzc.timerPeriod = 0;
    pData->hwzc.integrator = 0;
#if FEATURE_HWZC_PI_FLOAT
    pData->hwzc.integratorF = 0.0f;
#endif
    pData->hwzc.lastCaptureHR = 0;
    pData->hwzc.prevCommHR = 0;
    pData->hwzc.captureValid = false;
    pData->hwzc.stepPeriodForFilterComp = 0;
    pData->hwzc.dbgPiDelta = 0;
    pData->hwzc.dbgPiCaptureCount = 0;
    pData->hwzc.dbgPiMissCount = 0;
    for (uint8_t s = 0; s < 6; s++) {
        pData->hwzc.dbgPiMissBySector[s] = 0;
        pData->hwzc.dbgPiCapBySector[s] = 0;
    }
#endif
#if FEATURE_BEMF_INTEGRATION
    pData->hwzc.shadowHwzcSkipCount = 0;
    pData->hwzc.obsCommSeq = 0;
    pData->hwzc.obsLastCommTick = 0;
#endif

    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);
}

/**
 * @brief Activate hardware ZC detection. Called from ADC ISR at the
 * post-CheckDeadline commutation hook when enablePending && wasZcDeadline.
 * The new step has just been applied by COMMUTATION_AdvanceStep().
 */
void HWZC_Enable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = true;
    pData->hwzc.enablePending = false;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.noiseRejectCount = 0;
    pData->hwzc.stepsSinceLastHwZc = 1;  /* First step: IIR valid with seeded lastZcStamp */
    pData->hwzc.firstZcAfterEnable = true; /* Bypass plausibility gate + IIR on 1st ZC */

    /* Seed stepPeriodHR from software ZC step period */
    pData->hwzc.dbgEnableStepPeriod = pData->timing.stepPeriod;
    pData->hwzc.stepPeriodHR = HWZC_ADC_TO_SCCP2(pData->timing.stepPeriod);

    /* Initialize timestamps. Seed lastZcStamp to half a step period before
     * now so the first measured interval (first real ZC - lastZcStamp) is
     * approximately one full step, not half a step. Without this, the first
     * IIR update biases stepPeriodHR low, causing an early commutation. */
    uint32_t now = HAL_SCCP2_ReadTimestamp();
    pData->hwzc.lastZcStamp = now - pData->hwzc.stepPeriodHR / 2;
    pData->hwzc.lastCommStamp = now;

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI seed: start timerPeriod at the IIR-seeded stepPeriodHR
     * (the same value the reactive path uses for its first commutation
     * scheduling). integrator tracks timerPeriod 1:1. prevCommHR matches
     * lastCommStamp so the first capValue (computed at next PI fire)
     * uses a sensible base. captureValid stays false until first ZC. */
    pData->hwzc.timerPeriod   = pData->hwzc.stepPeriodHR;
    pData->hwzc.integrator    = pData->hwzc.stepPeriodHR;
    pData->hwzc.prevCommHR    = now;
    pData->hwzc.lastCaptureHR = now - pData->hwzc.stepPeriodHR / 2;
    pData->hwzc.captureValid  = false;
    pData->hwzc.stepPeriodForFilterComp = pData->hwzc.stepPeriodHR;
#if FEATURE_HWZC_PI_FLOAT
  #if HWZC_PI_FF_ENABLE
    /* Feedforward mode: integratorF holds residual (signed). Start at 0. */
    pData->hwzc.integratorF = 0.0f;
  #else
    /* Pure float port: integratorF = period (matches integer integrator). */
    pData->hwzc.integratorF = (float)pData->hwzc.stepPeriodHR;
  #endif
#endif
#endif

    /* Enable SCCP1 interrupt (priority already set by ServiceInit).
     * Clear any stale flag first to prevent immediate spurious ISR entry. */
    _CCT1IF = 0;
    _CCT1IE = 1;

    /* Arm hardware for the current (new) step */
    HWZC_OnCommutation(pData);
}

/**
 * @brief Deactivate hardware ZC and request fallback to software ZC.
 * Called from SCCP1 ISR (on miss-limit) or when eRPM drops below crossover.
 * Sets fallbackPending for the ADC ISR to perform the actual re-seed.
 */
void HWZC_Disable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = false;

    /* Stop timer and disable all HW ZC interrupts.
     * Clear _CCT1IF to prevent stale event on next HWZC_Enable(). */
    HAL_SCCP1_Stop();
    _CCT1IE = 0;
    _CCT1IF = 0;
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);

    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.fallbackPending = true;
}

/**
 * @brief Set up ZC detection for the current commutation step.
 * Configures comparator channel, PINSEL, threshold, and starts blanking timer.
 * Called from SCCP1 ISR after commutation fires, and from HWZC_Enable().
 */
void HWZC_OnCommutation(volatile GARUDA_DATA_T *pData)
{
    uint32_t now = HAL_SCCP2_ReadTimestamp();
#if FEATURE_HWZC_SECTOR_PI
    /* Save previous commutation timestamp before overwriting — capValue is
     * computed as (lastCaptureHR - prevCommHR) at next OnPiPeriodExpired. */
    pData->hwzc.prevCommHR = pData->hwzc.lastCommStamp;
#endif
    pData->hwzc.lastCommStamp = now;
    pData->hwzc.rejectsThisStep = 0;

    /* Determine floating phase and comparator for this step */
    uint8_t step = pData->currentStep;
    uint8_t floatPhase = commutationTable[step].floatingPhase;
    int8_t pol = commutationTable[step].zcPolarity;
    bool risingZc = (pol > 0);

